; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-2-2-6)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	truck1 - truck
	truck2 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-1 - location
	p1-0 - location
	p1-2 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s2)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s0)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at package1 s0)
	(at package2 s1)
	(at package3 s1)
	(at package4 s1)
	(at package5 s2)
	(at package6 s2)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 17)
	(= (time-to-drive s1 s0) 17)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 91)
	(= (time-to-drive s2 s0) 91)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 89)
	(= (time-to-drive s2 s1) 89)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver2 s1)
	(at truck1 s2)
	(at truck2 s0)
	(at package1 s2)
	(at package2 s0)
	(at package3 s1)
	(at package4 s1)
	(at package5 s2)
	(at package6 s0)
	))

(:metric minimize (+ (* 1 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (board-truck driver2 truck1 s2)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 5 of 10
2. (load-truck package6 truck1 s2)
   deleted: (at package6 s2)
   added: (in package6 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 5 of 10
3. (drive-truck truck1 s2 s1 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 0 to 979
   goals met: 4 of 10
4. (load-truck package2 truck1 s1)
   deleted: (at package2 s1)
   added: (in package2 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 4 of 10
5. (drive-truck truck1 s1 s0 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 979 to 1200
   goals met: 4 of 10
6. (unload-truck package2 truck1 s0)
   deleted: (in package2 truck1)
   added: (at package2 s0)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 5 of 10
7. (unload-truck package6 truck1 s0)
   deleted: (in package6 truck1)
   added: (at package6 s0)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 6 of 10
8. (load-truck package1 truck1 s0)
   deleted: (at package1 s0)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 6 of 10
9. (drive-truck truck1 s0 s2 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (fuel-used) from 1200 to 2201
   goals met: 7 of 10
10. (unload-truck package1 truck1 s2)
   deleted: (in package1 truck1)
   added: (at package1 s2)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 8 of 10
11. (drive-truck truck1 s2 s1 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 2201 to 3091
   goals met: 7 of 10
12. (drive-truck truck1 s1 s0 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 3091 to 3261
   goals met: 7 of 10
13. (disembark-truck driver2 truck1 s0)
   deleted: (driving driver2 truck1)
   added: (at driver2 s0) (empty truck1)
   goals met: 7 of 10
14. (walk driver2 s0 p0-1)
   deleted: (at driver2 s0)
   added: (at driver2 p0-1)
   goals met: 7 of 10
15. (board-truck driver1 truck1 s0)
   deleted: (at driver1 s0) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 7 of 10
16. (walk driver2 p0-1 s1)
   deleted: (at driver2 p0-1)
   added: (at driver2 s1)
   goals met: 8 of 10
17. (drive-truck truck1 s0 s2 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (fuel-used) from 3261 to 4171
   goals met: 9 of 10
18. (disembark-truck driver1 truck1 s2)
   deleted: (driving driver1 truck1)
   added: (at driver1 s2) (empty truck1)
   goals met: 10 of 10
